5. Configure IP Addresses With Telnet Access
The next step is to decide which IP addresses will have access to Telnet,
and add them with the PuTTY CLI. To select permitted IP’s enter the
following command (replace the listed IPs with the IPs of the components
you want to grant permission to):
access-switch1(config)# ip access-list standard TELNET-ACCESS
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# exit
You can also configure your network’s access control lists (ACLs) to virtual
terminal (VTY) lines. ACLs ensure that only the administrator can connect
to the router through Telnet.
access-switch1(config)# line vty 0 15
access-switch1(config-line)# access-class TELNET-ACCESS in
access-switch1(config-line)# exit






5. Configure IP Addresses With Telnet Access
The next step is to decide which IP addresses will have access to Telnet,
and add them with the PuTTY CLI. To select permitted IP’s enter the
following command (replace the listed IPs with the IPs of the components
you want to grant permission to):
access-switch1(config)# ip access-list standard TELNET-ACCESS
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# exit
You can also configure your network’s access control lists (ACLs) to virtual
terminal (VTY) lines. ACLs ensure that only the administrator can connect
to the router through Telnet.
access-switch1(config)# line vty 0 15
access-switch1(config-line)# access-class TELNET-ACCESS in
access-switch1(config-line)# exit









5. Configure IP Addresses With Telnet Access
The next step is to decide which IP addresses will have access to Telnet,
and add them with the PuTTY CLI. To select permitted IP’s enter the
following command (replace the listed IPs with the IPs of the components
you want to grant permission to):
access-switch1(config)# ip access-list standard TELNET-ACCESS
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# exit
You can also configure your network’s access control lists (ACLs) to virtual
terminal (VTY) lines. ACLs ensure that only the administrator can connect
to the router through Telnet.
access-switch1(config)# line vty 0 15
access-switch1(config-line)# access-class TELNET-ACCESS in
access-switch1(config-line)# exit


5. Configure IP Addresses With Telnet Access
The next step is to decide which IP addresses will have access to Telnet,
and add them with the PuTTY CLI. To select permitted IP’s enter the
following command (replace the listed IPs with the IPs of the components
you want to grant permission to):
access-switch1(config)# ip access-list standard TELNET-ACCESS
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# permit 216.174.200.21
access-switch1(config-std-nacl)# exit
You can also configure your network’s access control lists (ACLs) to virtual
terminal (VTY) lines. ACLs ensure that only the administrator can connect
to the router through Telnet.
access-switch1(config)# line vty 0 15
access-switch1(config-line)# access-class TELNET-ACCESS in
access-switch1(config-line)# exit